[
    {
        "category": 1,
        "description": "Лягте на спину, руки за головой, локти разведены. Поднимите ноги, согнув их в коленях под углом 90 градусов. Поочередно тянитесь локтем к противоположному колену, одновременно выпрямляя другую ногу. Двигайтесь плавно, имитируя вращение педалей велосипеда.",
        "image_url": "assets/exercises/abs/bicycle-crunch.gif",
        "name": "Велосипедные скручивания"
    },
    {
        "category": 1,
        "description": "Примите упор лёжа, опираясь на предплечья и носки ног. Тело должно быть прямым, без прогибов в пояснице или подъема таза. Удерживайте это положение как можно дольше, напрягая мышцы пресса.",
        "image_url": "assets/exercises/abs/front-plank.gif",
        "name": "Планка на предплечьях"
    },
    {
        "category": 1,
        "description": "Повисните на перекладине, удерживая тело прямым. Поднимите ноги, согнутые в коленях, до уровня груди, затем поднимите таз вверх, скручивая корпус. Медленно опуститесь в исходное положение.",
        "image_url": "assets/exercises/abs/hanging-leg-hip-raise.gif",
        "name": "Подъём ног в висе с подъёмом таза"
    },
    {
        "category": 1,
        "description": "Повисните на перекладине, удерживая тело прямым. Поднимите прямые ноги до уровня параллели с полом или выше, затем медленно опустите их обратно. Не раскачивайтесь и контролируйте движение.",
        "image_url": "assets/exercises/abs/hanging-leg-raise.gif",
        "name": "Подъём ног в висе"
    },
    {
        "category": 1,
        "description": "Лягте на спину, руки вдоль тела. Поднимите ноги, согнутые в коленях, и подтяните их к груди, одновременно отрывая таз от пола. Медленно вернитесь в исходное положение.",
        "image_url": "assets/exercises/abs/reverse-crunch.gif",
        "name": "Обратные скручивания"
    },
    {
        "category": 1,
        "description": "Лягте на бок, одна рука за головой, другая на полу для поддержки. Поднимайте корпус, скручиваясь в сторону, чтобы локоть тянулся к бедру. Повторите на другую сторону.",
        "image_url": "assets/exercises/abs/side-crunch.gif",
        "name": "Боковые скручивания"
    },
    {
        "category": 1,
        "description": "Лягте на бок, опираясь на предплечье и боковую часть стопы. Поднимите таз, выпрямляя тело в одну линию. Удерживайте положение, напрягая мышцы пресса и косые мышцы живота.",
        "image_url": "assets/exercises/abs/side-plank.gif",
        "name": "Боковая планка"
    },
    {
        "category": 1,
        "description": "Примите упор лёжа, как в классической планке. Поочередно подтягивайте колено к локтю на той же стороне, стараясь не терять равновесие. Двигайтесь плавно и контролируемо.",
        "image_url": "assets/exercises/abs/spider-plank.gif",
        "name": "Планка «Паук»"
    },
    {
        "category": 2,
        "description": "Примите упор лёжа, поставив руки близко друг к другу так, чтобы большие и указательные пальцы образовали форму ромба. Опуститесь вниз, сгибая локти, затем вернитесь в исходное положение, выпрямляя руки.",
        "image_url": "assets/exercises/arms/diamond-push-up.gif",
        "name": "Алмазные отжимания"
    },
    {
        "category": 2,
        "description": "Возьмите гантели и держите их параллельно друг другу. Согните руки в локтях, поднимая гантели к плечам, затем медленно опустите их в исходное положение. Удерживайте локти неподвижными.",
        "image_url": "assets/exercises/arms/dumbbell-close-grip-curl.gif",
        "name": "Сгибание рук с гантелями узким хватом"
    },
    {
        "category": 2,
        "description": "Сядьте на наклонную скамью, держа гантели в руках. Медленно согните руки в локтях, поднимая гантели к плечам, затем плавно опустите их обратно. Удерживайте локти неподвижными.",
        "image_url": "assets/exercises/arms/dumbbell-incline-biceps-curl.gif",
        "name": "Сгибание рук с гантелями на наклонной скамье"
    },
    {
        "category": 2,
        "description": "Сядьте на скамью с прямой спинкой, держа гантель обеими руками за один из концов. Поднимите гантель над головой, затем медленно опустите её за голову, сгибая локти. Вернитесь в исходное положение.",
        "image_url": "assets/exercises/arms/dumbbell-seated-triceps-extension.gif",
        "name": "Жим гантели из-за головы сидя"
    },
    {
        "category": 2,
        "description": "Закрепите резиновую ленту на уровне груди или выше. Возьмитесь за ручки ленты и встаньте прямо. Разгибайте руки вниз, полностью выпрямляя локти, затем медленно возвращайтесь в исходное положение.",
        "image_url": "assets/exercises/arms/resistance-band-triceps-pushdown.gif",
        "name": "Разгибание рук с резиновой лентой"
    },
    {
        "category": 2,
        "description": "Сядьте на край скамьи, руки поставьте на её край, пальцы направлены вперёд. Опустите тело вниз, сгибая локти, затем вернитесь в исходное положение, выпрямляя руки.",
        "image_url": "assets/exercises/triceps/triceps-dip.gif",
        "name": "Отжимания на трицепс"
    },
    {
        "category": 3,
        "description": "Закрепите резинку на перекладине и вставьте в неё ноги. Примите упор, подтягиваясь вверх, используя помощь резинки для облегчения движения. Сосредоточьтесь на контроле при опускании.",
        "image_url": "assets/exercises/back/band-assisted-pull-up.gif",
        "name": "Подтягивание с помощью резинки"
    },
    {
        "category": 3,
        "description": "Сядьте на тренажёр для тяги, возьмитесь за ручки узким хватом. Тяните ручки вниз к груди, сводя лопатки вместе, затем медленно вернитесь в исходное положение.",
        "image_url": "assets/exercises/back/cable-bar-lateral-pulldown.gif",
        "name": "Тяга на верхнем блоке с узким хватом"
    },
    {
        "category": 3,
        "description": "Сядьте на тренажёр для тяги, возьмитесь за ручки на ширине плеч. Тяните ручки вниз к груди, сводя лопатки вместе, затем медленно вернитесь в исходное положение.",
        "image_url": "assets/exercises/back/cable-pulldown.gif",
        "name": "Тяга на верхнем блоке"
    },
    {
        "category": 3,
        "description": "Примите упор на перекладине, руки расположите близко друг к другу. Подтягивайтесь вверх, сводя лопатки, затем медленно опуститесь в исходное положение.",
        "image_url": "assets/exercises/back/close-grip-pull-up.gif",
        "name": "Подтягивание с узким хватом"
    },
    {
        "category": 3,
        "description": "Встаньте под перекладину, подпрыгните и схватитесь за неё. Используйте силу прыжка, чтобы подтянуться вверх, затем медленно опуститесь.",
        "image_url": "assets/exercises/back/jumping-pull-up.gif",
        "name": "Подтягивание с прыжком"
    },
    {
        "category": 3,
        "description": "Примите упор на перекладине, руки на ширине плеч. Подтягивайтесь вверх, сводя лопатки, затем медленно опуститесь в исходное положение.",
        "image_url": "assets/exercises/back/pull-up.gif",
        "name": "Подтягивание"
    },
    {
        "category": 3,
        "description": "Примите упор на перекладине, руки расположите шире плеч. Подтягивайтесь вверх, сводя лопатки, затем медленно опуститесь в исходное положение.",
        "image_url": "assets/exercises/back/wide-grip-pull-up.gif",
        "name": "Подтягивание с широким хватом"
    },
    {
        "category": 4,
        "description": "Примите упор лёжа, закрепив резинку за спиной и удерживая её руками. Выполняйте отжимания, преодолевая сопротивление резинки, затем возвращайтесь в исходное положение.",
        "image_url": "assets/exercises/chest/band-push-up.gif",
        "name": "Отжимания с резинкой"
    },
    {
        "category": 4,
        "description": "Примите упор лёжа. Опуститесь вниз, затем резко оттолкнитесь вверх, чтобы руки оторвались от пола, и выполните хлопок перед грудью. Мягко приземлитесь и повторите.",
        "image_url": "assets/exercises/chest/clap-push-up.gif",
        "name": "Хлопковые отжимания"
    },
    {
        "category": 4,
        "description": "Примите упор лёжа, поставив руки близко друг к другу, чтобы ладони находились под грудью. Опуститесь вниз, сгибая локти вдоль корпуса, затем вернитесь в исходное положение.",
        "image_url": "assets/exercises/chest/close-grip-push-up.gif",
        "name": "Отжимания узким хватом"
    },
    {
        "category": 4,
        "description": "Поставьте ноги на возвышение (например, скамью), а руки на пол. Выполняйте отжимания, опуская грудь к полу, затем возвращайтесь в исходное положение.",
        "image_url": "assets/exercises/chest/decline-push-up.gif",
        "name": "Отжимания с наклоном вниз"
    },
    {
        "category": 4,
        "description": "Примите упор лёжа, поставив руки на возвышение (например, параллельные брусья или блоки). Опуститесь ниже уровня рук, затем вернитесь в исходное положение.",
        "image_url": "assets/exercises/chest/deep-push-up.gif",
        "name": "Глубокие отжимания"
    },
    {
        "category": 4,
        "description": "Примите упор лёжа, руки на ширине плеч. Опуститесь вниз, сгибая локти, пока грудь не окажется близко к полу, затем вернитесь в исходное положение.",
        "image_url": "assets/exercises/chest/push-up.gif",
        "name": "Классические отжимания"
    },
    {
        "category": 5,
        "description": "Встаньте спиной к скамье, одну ногу положите на скамью. Держа спину прямой, опуститесь вниз, сгибая переднюю ногу в колене, пока бедро не станет параллельно полу. Затем вернитесь в исходное положение.",
        "image_url": "assets/exercises/legs/bulgarian-split-squat.gif",
        "name": "Болгарский сплит-присед"
    },
    {
        "category": 5,
        "description": "Возьмите гантели в обе руки и встаньте прямо. Сделайте шаг вперёд одной ногой, опускаясь вниз, пока оба колена не согнутся под углом 90 градусов. Вернитесь в исходное положение и повторите с другой ноги.",
        "image_url": "assets/exercises/legs/dumbbell-lunge.gif",
        "name": "Выпады с гантелями"
    },
    {
        "category": 5,
        "description": "Встаньте прямо, ноги на ширине плеч. Опуститесь в присед, затем резко выпрыгните вверх, выпрямляя тело. Мягко приземлитесь и сразу повторите.",
        "image_url": "assets/exercises/legs/jump-squat.gif",
        "name": "Прыжковые приседания"
    },
    {
        "category": 5,
        "description": "Встаньте прямо, сделайте шаг вперёд одной ногой, опускаясь вниз, пока оба колена не согнутся под углом 90 градусов. Вернитесь в исходное положение и повторите с другой ноги.",
        "image_url": "assets/exercises/legs/lunge.gif",
        "name": "Выпады"
    },
    {
        "category": 5,
        "description": "Примите положение выпада. Выпрыгните вверх, меняя ноги в воздухе, и приземлитесь в выпад с другой ноги. Повторяйте движение плавно и контролируемо.",
        "image_url": "assets/exercises/legs/lunge-with-jump.gif",
        "name": "Выпады с прыжком"
    },
    {
        "category": 5,
        "description": "Встаньте прямо, ноги шире плеч. Сделайте шаг в сторону, сгибая одну ногу в колене, а другую оставляя прямой. Вернитесь в исходное положение и повторите на другую сторону.",
        "image_url": "assets/exercises/legs/side-lunge.gif",
        "name": "Боковые выпады"
    },
    {
        "category": 5,
        "description": "Встаньте прямо, ноги на ширине плеч. Опуститесь вниз, сгибая колени и отводя таз назад, пока бедра не станут параллельны полу. Затем вернитесь в исходное положение.",
        "image_url": "assets/exercises/legs/squat.gif",
        "name": "Приседания"
    },
    {
        "category": 6,
        "description": "Встаньте прямо, держа резинку в обеих руках на уровне бедер. Поднимите руки вперёд до уровня плеч, затем медленно опустите их обратно в исходное положение.",
        "image_url": "assets/exercises/shoulders/band-front-raise.gif",
        "name": "Подъём резинки вперёд"
    },
    {
        "category": 6,
        "description": "Закрепите резинку под ногами и держите её в обеих руках на уровне плеч. Поднимите руки вверх, выпрямляя локти, затем медленно опустите их обратно.",
        "image_url": "assets/exercises/shoulders/band-shoulder-press.gif",
        "name": "Жим резинки над головой"
    },
    {
        "category": 6,
        "description": "Встаньте прямо, держа штангу на уровне бедер. Поднимите штангу к подбородку, сгибая локти и сводя их к телу, затем медленно опустите обратно.",
        "image_url": "assets/exercises/shoulders/barbell-upright-row.gif",
        "name": "Подъём штанги к подбородку"
    },
    {
        "category": 6,
        "description": "Встаньте прямо, держа гантели в обеих руках на уровне бедер. Поднимите гантели вперёд до уровня плеч, затем медленно опустите их обратно.",
        "image_url": "assets/exercises/shoulders/dumbbell-front-raise.gif",
        "name": "Подъём гантелей вперёд"
    },
    {
        "category": 6,
        "description": "Встаньте прямо, держа гантели в обеих руках. Поднимите руки в стороны до уровня плеч, затем медленно опустите их обратно в исходное положение.",
        "image_url": "assets/exercises/shoulders/dumbbell-lateral-raise.gif",
        "name": "Боковой подъём гантелей"
    },
    {
        "category": 6,
        "description": "Встаньте прямо, держа гантели на уровне плеч. Поднимите гантели вверх, выпрямляя локти, затем медленно опустите их обратно.",
        "image_url": "assets/exercises/shoulders/dumbbell-standing-overhead-press.gif",
        "name": "Жим гантелей над головой стоя"
    },
    {
        "category": 6,
        "description": "Примите положение планки, опираясь на руки и носки. Поочередно поднимайте одну руку вверх, удерживая тело в стабильном положении, затем вернитесь в исходное положение.",
        "image_url": "assets/exercises/shoulders/plank-arm-lifts.gif",
        "name": "Подъём рук в планке"
    },
    {
        "category": 6,
        "description": "Встаньте прямо, держа гантели в обеих руках. Поднимите руки в стороны и вверх, формируя букву Т, затем медленно опустите их обратно.",
        "image_url": "assets/exercises/shoulders/standing-t-raise.gif",
        "name": "Подъём в форме буквы Т"
    }
]